import biblioteka as quest

quest.name()
print(quest.health)

phrases = {
    1: 'человек шел летним вечером по парку, зашёл на причал и его смыло волной в море и принесло на остров из мусора, на котором уже выросли деревья и завелись животные. Этот странный человек, каждый раз, идя в парк, берет с собой рюкзак с веревкой, 3 яблоками, 2 помидорами, палкой колбасы, спичками, бутылкой воды.
На острове персонаж нашел карту острова, которую составлял человек, живший на острове, до него. 
Уже темнеет, поэтому перед персонажем стоит выбор что делать'
    2: 'найти ночлег'
    3: 'пытаться уплыть с острова'
    3.2: 'Вы потеряли жизнь, потому что вы не знали куда плыть и утонули в море'
    4: 'вы видите 3 дороги, по карте в конце первой дороги есть диван, в конце второй - матрас, в конце третьей - большая картонная коробка. Первый путь самый длинный, вы дойдёте до конца, когда уже стемнеет, поэтому вы можете не увидеть, куда надо идти, второй путь короче первого, вы дойдёте до конца к темноте, если будете быстро идти, третий путь самый короткий, вы точно успеете дойти до темноты'
    5: '1 путь'
    6: '2 путь'
    7: '3 путь'
    8: 'Вы потеряли одну жизнь, потому что не успели дойти до темноты, а фонаря у вас нет, поэтому вас съел волк'
    9: 'Наступило утро, вы хорошо поспали, но со вчерашнего вечера вы ничего не ели, поэтому перед вами стоит выбор '
    10: 'Пойти на поиски еды'
    11: 'Съесть имеющуюся еду'
    12: 'Съесть часть имеющейся еды'
    13: 'Вы потеряли жизнь, так как вы долго не ели и у вас закончилась энергия'
    14: 'Вы отправились на поиски еды по дорожке и наткнулись на дерево с яблоками'
    15: 'Вы можете собрать яблоки и вернуться обратно'
    16: 'собрать яблоки и пойти дальше'
    17: 'не собирать яблоки и пойти дальше в надежде на лучшую добычу'
    18: 'Дальше по дорожке вам попадается куча консерв'
    19: 'Вы можете их ...'
    20: ''
    21: ''
    22: ''
    23: ''
    24: ''
}